<?php

return [
    'orders' => [
        'validations' => [
            'order_not_found' => 'هذا الطلب غير موجود حالياً',
            'order_rated' => 'تم تقييم الطلب من قبل',
            'user_id' => [
                'required' => 'ادخل رقم المستخدم',
                'exists' => 'هذا المستخدم غير موجود حالياً',
                'does_not_match' => 'هذا المستخدم غير مطابق للمستخدم الحالى',
            ],
            'company_delivery_fees' => [
                'required' => 'يرجى اختيار منطقة التوصيل لحساب قيمة التوصيل',
            ],
            'cart' => [
                'required' => 'يرجى اضافة منتجات للسله',
            ],
            'address_id' => [
                'required' => 'يرجى اختيار منطقة عنوان التوصيل',
            ],
            'shipping' => [
                'type' => [
                    'required' => 'يرجى اختيار آلية وقت التوصيل',
                ],
            ],
        ],
    ],
    'address' => [
        'validations' => [
            'address' => [
                'min' => 'من فضلك ادخل تفاصيل اكثر ، يجب الا يقل العنوان عن ١٠ احرف',
                'required' => 'من فضلك ادخل تفاصيل الطلب',
                'string' => 'من فضلك ادخل تفاصيل العنوان حروف و ارقام فقط',
            ],
            'block' => [
                'required' => 'من فضلك ادخل القطعة',
                'string' => 'من فضلك ادخل القطعة ارقام و احرف فقط',
            ],
            'building' => [
                'required' => 'من فضلك ادخل البناية',
                'string' => 'من فضلك ادخل البناية ارقام و احرف فقط',
            ],
            'email' => [
                'email' => 'من فضلك ادخل البريد الالكتروني بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'min' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'max' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الموبايل ارقام انجليزية فقط',
                'required' => 'من فضلك ادخل رقم الموبايل',
                'string' => 'من فضلك ادخل الموبايل كقيمة نصية',
            ],
            'state' => [
                'numeric' => 'من فضلك اختر المنطقة',
                'required' => 'من فضلك اختر المنطقة',
            ],
            'state_id' => [
                'numeric' => 'من فضلك اختر المنطقة',
                'required' => 'من فضلك اختر المنطقة',
            ],
            'street' => [
                'required' => 'من فضلك ادخل اسم / رقم الشارع',
                'string' => 'من فضلك ادخل الشارع ارقام و احرف فقط',
            ],
            'username' => [
                'min' => 'من فضلك ادخل اسم المستخدم ولا يقل عن حرفين',
                'required' => 'من فضلك ادخل اسم المستخدم',
                'string' => 'من فضلك ادخل اسم المستخدم حروف و ارقام فقط',
            ],
            'address_type' => [
                'required' => 'من فضلك اختر نوع عنوان التوصيل',
                'in' => 'قيم نوع عنوان التوصيل يجب ان تكون ضمن',
            ],
            'selected_address_id' => [
                'required' => 'من فضلك اختر عنوان من العناوين السابقة',
                'not_found' => 'هذا العنوان غير موجود حالياً',
            ],
        ],
    ],
    'payment' => [
        'validations' => [
            'required' => 'من فضلك اختر نوع طريقة الدفع',
            'in' => 'نوع طريقة الدفع يجب ان يكون ضمن:',
        ],
    ],
    'shipping_company' => [
        'validations' => [
            'day_code' => [
                'required' => 'من فضلك اختر كود يوم التوصيل',
            ],
            'day' => [
                'required' => 'من فضلك اختر يوم التوصيل',
            ],
        ],
    ],
    'product' => [
        'form' => [
            'product_id' => 'هذا المنتج رقم',
        ],
        'validations' => [
            'not_found' => 'غير متاح حالياً',
            'qty_exceeded' => 'الكمية المطلوبة غير متاحة للمنتج',
            'has_variations' => 'هذا المنتج يحتوى على منتجات اخرى "Variations" لا يمكن طلبه, يمكنك طلب منتج بداخله',
        ],
    ],
];
