<?php

return [
    'products' => [
        'datatable' => [
            'created_at' => 'تاريخ الآنشاء',
            'date_range' => 'البحث بالتواريخ',
            'image' => 'الصورة',
            'options' => 'الخيارات',
            'status' => 'الحالة',
            'title' => 'العنوان',
            'vendor' => 'المتجر',
        ],
        'form' => [
            'arrival_end_at' => 'تاريخ الانتهاء',
            'arrival_start_at' => 'تاريخ البدء',
            'arrival_status' => 'حالة الوصول حديثا',
            'brands' => 'العلامة التجارية للمنتج',
            'cost_price' => 'سعر الشراء',
            'description' => 'الوصف',
            'short_description' => 'وصف قصير',
            'end_at' => 'ينتهي التخفيض بتاريخ',
            'image' => 'الصورة',
            'meta_description' => 'Meta Description',
            'meta_keywords' => 'Meta Keywords',
            'offer' => 'تخفيض للمنتج',
            'offer_price' => 'السعر بعد التخفيض',
            'offer_status' => 'حالة التخفيض',
            'options' => 'اختيارات',
            'percentage' => 'نسبة مئوية',
            "new_add" => "الاضافات الجديده",
            'price' => 'السعر',
            'qty' => 'الكمية',
            'sku' => 'كود المنتج',
            'start_at' => 'يبدا التخفيض بتاريخ',
            'status' => 'الحالة',
            'featured' => 'منتج مميز',
            "width" => "العرض",
            "height" => "لارتفاع",
            "weight" => "الوزن",
            "length" => "الطول",
            "add_variations" => "عرض إختلافات المنتج",
            'sort' => 'الترتيب',
            'is_new' => 'منتج جديد',

            'offer_type' => [
                'label' => 'النوع',
                'amount' => 'مبلغ',
                'percentage' => 'نسبة مئوية',
            ],

            'tabs' => [
                'categories' => 'اقسام المنتج',
                'gallery' => 'صور إضافية / أكثر',
                'general' => 'بيانات عامة',
                'new_arrival' => 'وصل حديثا',
                'seo' => 'SEO',
                'stock' => 'المخزون و السعر',
                'variations' => 'اختلافات المنتج',
                'add_ons' => 'إضافات المنتج',
                'edit_add_ons' => 'تعديل إضافات المنتج',
                "shipment" => "ابعاد المنتج",

            ],
            'title' => 'عنوان',
            'vendors' => 'متجر المنتج',
            'add_ons' => [
                'name' => 'الاسم',
                'type' => 'النوع',
                'single' => 'اختيار واحد',
                'multiple' => 'اختيار متعدد',
                'option' => 'الإختيار',
                'price' => 'السعر',
                'default' => 'إفتراضي',
                'add_more' => 'إضافة المزيد',
                'save_options' => 'حفظ',
                'add_ons_name' => 'اسم الإضافة',
                'show' => 'عرض',
                'reset_form' => 'إضافة جديد',
                'customer_can_select_exactly' => 'يمكن للعميل الاختيار بدقة',
                'options_count' => 'عدد الإختيارات',
                'created_at' => 'تاريخ الإنشاء',
                'operations' => 'العمليات',
                'clear_defaults' => 'إزالة الإفتراضى',
                'confirm_msg' => 'هل انت متأكد ؟',
                'at_least_one_field' => 'مطلوب حقل واحد على الأقل',
                'options_count_greater_than_rows' => 'عدد إختيارات العميل يجب ان يكون اقل من إجمالى الإختيارات',
            ],
        ],
        'routes' => [
            'create' => 'اضافة المنتجات',
            'index' => 'المنتجات',
            'update' => 'تعديل المنتج',
            'add_ons' => 'إضافات المنتج',
        ],
        'validation' => [
            'arrival_end_at' => [
                'date' => 'من فضلك ادخل تاريخ الانتهاء - وصل حديثا كتاريخ فقط',
                'required' => 'من فضلك ادخل تاريخ الانتهاء - وصل حديثا',
            ],
            'arrival_start_at' => [
                'date' => 'من فضلك ادخل تاريخ البدء - وصل حديثا كتاريخ فقط',
                'required' => 'من فضلك ادخل تاريخ البدء - وصل حديثا',
            ],
            'brand_id' => [
                'required' => 'من فضلك اختر العلامة التجارية',
            ],
            'category_id' => [
                'required' => 'من فضلك اختر على الاقل قسم واحد',
            ],
            'cost_price' => [
                'numeric' => 'من فضلك ادخل سعر الشراء ارقام فقط',
                'required' => 'من فضلك ادخل سعر الشراء',
            ],
            'end_at' => [
                'date' => 'من فضلك ادخل تاريخ الانتهاء - الخصم كتاريخ فقط',
                'required' => 'من فضلك ادخل تاريخ الانتهاء - الخصم',
            ],
            'image' => [
                'required' => 'من فضلك اختر الصورة',
            ],
            'offer_price' => [
                'numeric' => 'من فضلك ادخل سعر الخصم للمنتج ارقام فقط',
                'required' => 'من فضلك ادخل سعر الخصم للمنتج',
            ],
            "width" => [
                'required' => 'من فضلك ادخل العرض',
                'numeric' => 'من فضلك ادخل العرض ارقام فقط',
            ],
            "length" => [
                'required' => 'من فضلك ادخل الطول',
                'numeric' => 'من فضلك ادخل الطول ارقام فقط',
            ],
            "weight" => [
                'required' => 'من فضلك ادخل الوزن',
                'numeric' => 'من فضلك ادخل الوزن ارقام فقط',
            ],
            "height" => [
                'required' => 'من فضلك ادخل الارتفاع',
                'numeric' => 'من فضلك ادخل الارتفاع ارقام فقط',
            ],
            'price' => [
                'numeric' => 'من فضلك ادخل السعر ارقام فقط',
                'required' => 'من فضلك ادخل السعر',
            ],
            'qty' => [
                'numeric' => 'من فضلك ادخل الكمية ارقام فقط',
                'required' => 'من فضلك ادخل الكمية',
            ],
            'sku' => [
                'required' => 'من فضلك ادخل كود المنتج',
            ],
            'start_at' => [
                'date' => 'من فضلك ادخل تاريخ البدء - الخصم كتاريخ فقط',
                'required' => 'من فضلك ادخل تاريخ البدء - الخصم',
            ],
            'title' => [
                'required' => 'من فضلك ادخل العنوان',
                'unique' => 'هذا العنوان تم ادخالة من قبل',
            ],
            'variation_price' => [
                'required' => 'من فضلك ادخل سعر المنتج الاختياري',
            ],
            'variation_qty' => [
                'required' => 'من فضلك ادخل كمية المنتج الاختياري',
            ],
            'variation_sku' => [
                'required' => 'من فضلك ادخل كود المنتج الاختياري',
            ],
            'variation_status' => [
                'required' => 'من فضلك اختر حالة المنتج الاختياري',
            ],
            'vendor_id' => [
                'required' => 'من فضلك اختر المتجر',
            ],
            'add_ons' => [
                'option_name' => [
                    'required' => 'من فضلك ادخل اسم إضافة المنتج',
                ],
                'add_ons_type' => [
                    'required' => 'من فضلك اختر نوع إضافة المنتج',
                    'in' => 'نوع إضافة المنتج يجب ان تكون بين',
                ],
                'price' => [
                    'required' => 'من فضلك ادخل سعر اختيار إضافة المنتج',
                    'array' => 'سعر اختيار إضافة المنتج يجب ان يكون مصفوفة',
                ],
                'rowId' => [
                    'required' => 'من فضلك ادخل ارقام "IDs" إضافة المنتج',
                    'array' => 'ارقام "IDs" إضافة المنتج يجب ان يكون مصفوفة',
                ],
                'option' => [
                    'required' => 'من فضلك ادخل عناوين اختيار إضافة المنتج',
                    'array' => 'اختيار إضافة المنتج يجب ان يكون مصفوفة',
                    'min' => 'اختيار إضافة المنتج يجب ان يحتوى على عنصر واحد',
                ],
            ],
        ],
    ],
];
