<?php

return [
    'forget_password' => [
        'mail' => [
            'subject' => 'تعيين كلمة مرور جديدة',
        ],
        'messages' => [
            'success' => 'تم ارسال تعين كلمة المرور الجديدة بنجاح عبر البريد الالكتروني',
        ],
    ],
    'login' => [
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'failed' => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password' => [
                'min' => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
        ],
        'messages' => [
            'not_authorized' => 'عفوا لاتمتلك صلاحية الدخول.',
        ],
    ],
    'logout' => [
        'messages' => [
            'failed' => 'فشلت عملية تسجيل الخروج',
            'success' => 'تم تسجيل الخروج بنجاح',
        ],
    ],
    'password' => [
        'messages' => [
            'sent' => 'تم ارسال بريد بتعيين كلمة مرور جديدة',
        ],
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
        ],
    ],
    'register' => [
        'messages' => [
            'failed' => 'فشلت عملية تسجيل الدخول ، حاول مره اخرى',
        ],
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
                'unique' => 'هذا البريد الالكتروني تم حجزة من قبل شخص اخر',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                'required' => 'من فضلك ادخل رقم الهاتف',
                'unique' => 'رقم الهاتف تم حجزه من قبل شخص اخر',
            ],
            'name' => [
                'required' => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password' => [
                'confirmed' => 'كلمة المرور غير متطابقة مع التآكيد',
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
        ],
    ],
    'reset' => [
        'mail' => [
            'button_content' => 'تعيين كلمة مرور جديدة',
            'header' => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعيين كلمة مرور جديدة لفقدانك القديمة',
            'subject' => 'تعيين كلمة مرور جديدة',
        ],
        'title' => 'تعيين كلمة مرور جديدة',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password' => [
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'token' => [
                'exists' => 'انتهت صلاحية هذا الطلب',
                'required' => 'لا تملك صلاحية تعيين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
    ],
];
