<?php

return [
    'users' => [
        'validation'    => [
            'current_password'  => [
                'not_match' => 'كلمة المرور الحالية غير مطابقة',
                'required'  => 'من فضلك ادخل كلمة المرور الحالية',
            ],
            'email'             => [
                'required'  => 'من فضلك ادخل البريد الالكتروني',
                'unique'    => 'هذا البريد تم ادخالة من قبل',
            ],
            'mobile'            => [
                'digits_between'    => 'من فضلك ادخل ٨ ارقام فقط داخل رقم الهاتف',
                'numeric'           => 'يجب ان يتكون رقم الهاتف من ارقام فقط بالانجليزية',
                'required'          => 'من فضلك ادخل رقم الهاتف',
                'unique'            => 'رقم الهاتف تم ادخالة من قبل',
            ],
            'name'              => [
                'required'  => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password'          => [
                'min'       => 'يجب ان يتكون كلمة المرور من كلمة اكبر من ٦ مدخلات : ارقام او احرف',
                'required'  => 'من فضلك ادخل كلمة المرور',
                'same'      => 'كلمة المرور غير متطابقة مع التآكيد',
            ],
            'firebase_token'   => [
                'required'  => 'من فضلك ادخل معرف الفاير بيز',
                'string'    => 'معرف الفاير بيز لابد ان يكون نصى',
            ],
            'device_type'   => [
                'required'  => 'من فضلك ادخل نوع الجهاز',
                'integer'   => 'نوع الجهاز لابد ان يكون قيمة رقمية',
                'in'        => 'قيمة نوع الجهاز غير موجودة',
            ],
        ],
        'alerts' => [
            'user_deleted_before' => 'تم حذف الحساب بالفعل',
            'user_deleted_successfully' => 'تم حذف الحساب بنجاح',
            'user_not_found' => 'المستخدم غير موجود حالياً',
        ],
    ],
    'favourites' => [
        'validation'    => [
            'product_id'  => [
                'required'      => 'من فضلك ادخل رقم المنتج',
                'exists'        => 'هذا المنتج غير موجود حالياً',
            ],
        ],
    ],
];
