<?php

return [
    'addresses' => [
        'btn' => [
            'edit' => 'تعديل العنوان',
            'store' => 'إضافة عنوان',
        ],
        'edit' => [
            'title' => 'تعديل العنوان',
        ],
        'create' => [
            'title' => 'إضافة عنوان جديد',
        ],
        'form' => [
            'address_details' => 'تفاصيل العنوان',
            'block' => 'رقم القطعة',
            'building' => 'رقم البناية',
            'email' => 'البريد',
            'optional_email' => 'البريد اختيارى',
            'kuwait' => 'الكويت',
            'mobile' => 'الموبايل',
            'states' => 'اختر المنطقة',
            'select_country' => 'اختر الدولة',
            'select_city' => 'اختر المدينة',
            'select_state' => 'اختر المنطقة',
            'state_name' => 'المنطقة',
            'country' => 'الدولة',
            'city' => 'المدينة',
            'street' => 'الشارع',
            'username' => 'اسم المستخدم',
            'civil_id' => 'رقم المدنى',
            'district' => 'الجاده',
            'avenue' => 'الجاده',
            'flat' => 'الشقة',
            'floor' => 'الطابق',
            'automated_number' => 'الرقم الآلى',
            'additions' => 'إتجاهات اخرى',
            'additional_instructions' => 'ارشادات اضافية',
        ],
        'index' => [
            'alert' => [
                'error' => 'حدث خطا ما ، حاول مره اخرى',
                'success' => 'تم تعديل العنوان بنجاح',
                'success_' => 'تم اضافة العنوان بنجاح',
                'delete' => 'تم حذف العنوان بنجاح',
                'no_addresses' => 'لا يوجد عناوين مسجلة',
            ],
            'btn' => [
                'add' => 'اضافة عنوان جديد',
                'delete' => 'حذف',
                'edit' => 'تعديل',
            ],
            'title' => 'العناوين السابقة',
        ],
        'validations' => [
            'address' => [
                'min' => 'من فضلك ادخل تفاصيل اكثر ، يجب الا يقل العنوان عن ١٠ احرف',
                'required' => 'من فضلك ادخل تفاصيل الطلب',
                'string' => 'من فضلك ادخل تفاصيل العنوان حروف و ارقام فقط',
            ],
            'block' => [
                'required' => 'من فضلك ادخل القطعة',
                'string' => 'من فضلك ادخل القطعة ارقام و احرف فقط',
            ],
            'building' => [
                'required' => 'من فضلك ادخل البناية',
                'string' => 'من فضلك ادخل البناية ارقام و احرف فقط',
            ],
            'email' => [
                'email' => 'من فضلك ادخل البريد الالكتروني بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'min' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'max' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الموبايل ارقام انجليزية فقط',
                'required' => 'من فضلك ادخل رقم الموبايل',
                'string' => 'من فضلك ادخل الموبايل كقيمة نصية',
            ],
            'state' => [
                'numeric' => 'من فضلك اختر المنطقة',
                'required' => 'من فضلك اختر المنطقة',
            ],
            'state_id' => [
                'numeric' => 'من فضلك اختر المنطقة',
                'required' => 'من فضلك اختر المنطقة',
            ],
            'street' => [
                'required' => 'من فضلك ادخل اسم / رقم الشارع',
                'string' => 'من فضلك ادخل الشارع ارقام و احرف فقط',
            ],
            'username' => [
                'min' => 'من فضلك ادخل اسم المستخدم ولا يقل عن حرفين',
                'required' => 'من فضلك ادخل اسم المستخدم',
                'string' => 'من فضلك ادخل اسم المستخدم حروف و ارقام فقط',
            ],
            'avenue' => [
                'required' => 'من فضلك ادخل الجاده',
                'string' => 'من فضلك ادخل الجاده حروف و ارقام فقط',
                'max' => 'عدد أحرف الجاده يجب ألا يزيد عن',
            ],
            'floor' => [
                'required' => 'من فضلك ادخل رقم الطابق',
                'string' => 'من فضلك ادخل رقم الطابق حروف و ارقام فقط',
                'max' => 'عدد أحرف رقم الطابق يجب ألا يزيد عن',
            ],
            'flat' => [
                'required' => 'من فضلك ادخل رقم الشقة',
                'string' => 'من فضلك ادخل رقم الشقة حروف و ارقام فقط',
                'max' => 'عدد أحرف رقم الشقة يجب ألا يزيد عن',
            ],
            'automated_number' => [
                'required' => 'من فضلك ادخل الرقم الآلى',
                'string' => 'من فضلك ادخل الرقم الآلى حروف و ارقام فقط',
                'max' => 'عدد أحرف الرقم الآلى يجب ألا يزيد عن',
            ],
        ],
    ],
    'profile' => [
        'index' => [
            'addresses' => 'العناوين السابقة',
            'my_orders' => 'طلباتي',
            'favourites' => 'المفضلة',
            'my_account' => 'حسابي',
            'btn_add_new_address' => 'إضافة عنوان',
            'alert' => [
                'error' => 'Opss! something wrong please try again later',
                'success' => 'تم تعديل الملف الشخصي بنجاح',
            ],
            'form' => [
                'form_title' => 'تعديل بياناتي',
                'btn' => [
                    'update' => 'تعديل البيانات',
                ],
                'current_password' => 'كلمة المرور الحالية',
                'email' => 'البريد الالكتروني',
                'mobile' => 'رقم الهاتف',
                'name' => 'الاسم الشخصي',
                'password' => 'كلمة المرور جديدة',
                'password_confirmation' => 'تأكيد كلمة المرور',
            ],
            'logout' => 'تسجيل خروج',
            'orders' => 'طلباتي',
            'title' => 'الملف الشخصي',
            'update' => 'تعديل البيانات الشخصية',
            'validation' => [
                'current_password' => [
                    'not_match' => 'كلمة المرور الحالية غير صحيحة',
                    'required_with' => 'من فضلك ادخل كلمة المرور الحالية',
                ],
                'email' => [
                    'email' => 'من فضلك ادخل البريد بشكل صحيح',
                    'required' => 'من فضلك ادخل البريد الالكتروني',
                    'unique' => 'هذا البريد الالكتروني تم حجزة من قبل شخص اخر',
                ],
                'mobile' => [
                    'numeric' => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                    'required' => 'من فضلك ادخل رقم الهاتف',
                    'unique' => 'رقم الهاتف تم حجزه من قبل شخص اخر',
                ],
                'name' => [
                    'required' => 'من فضلك ادخل الاسم الشخصي',
                ],
                'password' => [
                    'confirmed' => 'كلمة المرور غير متطابقة مع التآكيد',
                    'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                    'required' => 'يجب ان تدخل كلمة المرور',
                    'required_with' => 'من فضلك ادخل كلمة المرور الجديدة',
                ],
            ],
        ],
    ],
    'favourites' => [
        'index' => [
            'alert' => [
                'error' => 'حدث خطا ما ، حاول مره اخرى',
                'success' => 'تم اضافة المنتج للمفضلة بنجاح',
                'delete' => 'تم حذف المنتج من المفضلة بنجاح',
                'exist' => 'هذا المنتج ضمن قائمة المفضلة لديك',
                'not_found' => 'هذا المنتج غير متاح حالياً',
            ],
        ],
    ],
];
