<?php

return [
    'forget_password' => [
        'mail' => [
            'subject' => 'تعين كلمة مرور جديدة',
        ],
        'messages' => [
            'success' => 'تم ارسال تعين كلمة المرور الجديدة بنجاح عبر البريد الالكتروني',
            'user_not_exist' => 'هذا المستخدم غير موجود',
            'user_exist' => 'هذا المستخدم موجود لدينا',
        ],
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                'required' => 'من فضلك ادخل رقم الهاتف',
                'unique' => 'رقم الهاتف تم حجزه من قبل شخص اخر',
                'exists' => 'رقم الهاتف غير موجود',
            ],
            'calling_code' => [
                'required' => 'من فضلك ادخل كود الدولة',
                'numeric' => 'من فضلك ادخل كود الدولة من ارقام انجليزية فقط',
                'max' => 'يجب ان يتكون كود الدولة من 3 ارقام',
            ],
            'firebase_id' => [
                'required' => 'من فضلك ادخل معرف Firebase',
                'exists' => 'معرف Firebase غير موجود',
            ],
            'code' => [
                'required' => 'من فضلك ادخل كود التأكيد',
            ],
        ],
    ],
    'login' => [
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'failed' => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password' => [
                'min' => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            "code_verified" => [
                "not_correct" => "كود التاكيد المدخل غير صحيح"
            ],
        ],
    ],
    'logout' => [
        'messages' => [
            'failed' => 'فشلت عملية تسجيل الخروج',
            'success' => 'تم تسجيل الخروج بنجاح',
        ],
    ],
    "resend" => [
        "success" => "تم ارسال الكود بنجاح"
    ],
    'password' => [
        'messages' => [
            'sent' => 'تم ارسال بريد بتعين كلمة مرور جديدة',
        ],
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
        ],
    ],
    'register' => [
        'messages' => [
            'failed' => 'فشلت عملية تسجيل الدخول ، حاول مره اخرى',
            "error_sms" => "خطا فى ارسال الرساله يرجى المحاوله  فى وقت اخر",
            "code_send" => "كود التفعيل الخاص بك هو: :code ",
            "code" => " كود التاكيد غير صحيح",
        ],
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
                'unique' => 'هذا البريد الالكتروني تم حجزة من قبل شخص اخر',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                'required' => 'من فضلك ادخل رقم الهاتف',
                'unique' => 'رقم الهاتف تم حجزه من قبل شخص اخر',
            ],
            'name' => [
                'required' => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password' => [
                'confirmed' => 'كلمة المرور غير متطابقة مع التآكيد',
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'calling_code' => [
                'required' => 'من فضلك ادخل كود الدولة',
                'numeric' => 'من فضلك ادخل كود الدولة من ارقام انجليزية فقط',
                'max' => 'يجب ان يتكون كود الدولة من 3 ارقام',
            ],
            'email_or_mobile' => [
                'required' => 'من فضلك ادخل البريد الالكتروني أو رقم الهاتف',
            ],
            'firebase_id' => [
                'required' => 'من فضلك ادخل معرف Firebase',
                'exists' => 'معرف Firebase غير موجود',
                'unique' => 'معرف Firebase تم حجزه من قبل شخص اخر',
            ],
        ],
    ],
    'reset' => [
        'mail' => [
            'button_content' => 'تعين كلمة مرور جديدة',
            'header' => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعين كلمة مرور جديدة لفقدانك القديمة',
            'subject' => 'تعين كلمة مرور جديدة',
        ],
        'title' => 'تعين كلمة مرور جديدة',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password' => [
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'token' => [
                'exists' => 'انتهت صلاحية هذا الطلب',
                'required' => 'لا تملك صلاحية تعين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
    ],
];
