<?php

return [
    'login' => [
        'form'          => [
            'btn'       => [
                'login' => 'تسجيل الدخول',
            ],
            'email'     => 'البريد الالكتروني',
            'password'  => 'كلمة المرور',
            'password_confirmation'  => 'تأكيد كلمة المرور',
            'forget_password'  => 'نسيت كلمة المرور؟',
        ],
        'routes'        => [
            'index' => 'تسجيل الدخول',
        ],
        'validations'   => [
            'email'     => [
                'email'     => 'من فضلك ادخل البريد بشكل صحيح',
                'required'  => 'من فضلك ادخل البريد الالكتروني',
            ],
            'failed'    => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password'  => [
                'min'       => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required'  => 'يجب ان تدخل كلمة المرور',
            ],
            'do_not_have_access' => 'عفوا ليس لديك صلاحية الدخول',
        ],
    ],
    'password' => [
        'alert' => [
            'reset_sent' => 'تم ارسال بريد بتعين كلمة مرور جديدة',
        ],
        'form' => [
            'btn' => [
                'password' => 'ارسال تعين كلمة المرور',
            ],
            'email' => 'البريد الالكتروني',
        ],
        'title' => 'فقدان كلمة المرور',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
        ],
    ],
    'reset' => [
        'form' => [
            'btn' => [
                'reset' => 'تعيين كلمة المرور الآن',
            ],
            'email' => 'البريد الالكتروني',
            'password' => 'كلمة المرور',
            'password_confirmation' => 'تأكيد كلمة المرور',
        ],
        'mail' => [
            'button_content' => 'تعين كلمة مرور جديدة',
            'header' => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعين كلمة مرور جديدة لفقدانك القديمة',
            'subject' => 'تعين كلمة مرور جديدة',
        ],
        'title' => 'تعين كلمة مرور جديدة',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password' => [
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'token' => [
                'exists' => 'انتهت صلاحية هذا الطلب',
                'required' => 'لا تملك صلاحية تعين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
    ],
];
