<?php

return [
    'login' => [
        'form' => [
            'btn' => [
                'forget_password' => 'نسيت كلمة المرور؟',
                'login' => 'تسجيل الدخول',
            ],
            'email' => 'البريد الالكتروني',
            'email_or_mobile' => 'البريد الالكتروني او رقم الهاتف بدون مفتاح الدولة',
            'password' => 'كلمة المرور',
            'remember_me' => 'تذكرني',
            'not_have_account' => 'ليس لديك حساب؟',
            'have_account' => 'لديك حساب بالفعل؟',
            'sign_up_now' => 'سجل الآن',
        ],
        'title' => 'تسجيل الدخول',
        'login_or_signup' => 'تسجيل دخول او انشاء حساب',
        'login_welcome_msg' => 'أهلا بك، يمكنك تسجيل الدخول من هنا',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
                'exists' => 'هذا المستخدم غير موجود لدينا',
            ],
            'failed' => 'هذه البيانات غير متطابقة لدينا من فضلك تآكد من بيانات تسجيل الدخول',
            'password' => [
                'min' => 'كلمة المرور يجب ان تكون اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
        ],
    ],
    'password' => [
        'alert' => [
            'reset_sent' => 'تم ارسال بريد بتعين كلمة مرور جديدة',
        ],
        'form' => [
            'btn' => [
                'password' => 'ارسال تعين كلمة المرور',
            ],
            'email' => 'البريد الالكتروني',
        ],
        'title' => 'فقدان كلمة المرور',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
        ],
    ],
    'register' => [
        'alert' => [
            'policy_privacy' => 'من خلال التسجيل قد وافقت على',
        ],
        'btn' => [
            'policy_privacy' => 'الشروط و الاحكام',
            'register' => 'تسجيل مستخدم جديد',
        ],
        'form' => [
            'email' => 'البريد الالكتروني',
            'mobile' => 'رقم الهاتف',
            'name' => 'الاسم',
            'password' => 'كلمة المرور',
            'password_confirmation' => 'تآكيد كلمة المرور',
        ],
        'title' => 'تسجيل مستخدم جديد',
        'register_new_account' => 'إنشاء حساب جديد',
        'register_welcome_msg' => 'اهلا بك، يمكنك انشاء حساب جديد من هنا',
        'terms_msg' => 'من خلال التسجيل قد وافقت على',
        'terms_and_conditions' => 'الشروط و الاحكام',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'required' => 'من فضلك ادخل البريد الالكتروني',
                'unique' => 'هذا البريد الالكتروني تم حجزة من قبل شخص اخر',
            ],
            'mobile' => [
                'digits_between' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'digits' => 'يجب ان يتكون رقم الهاتف من ٨ ارقام',
                'numeric' => 'من فضلك ادخل رقم الهاتف من ارقام انجليزية فقط',
                'required' => 'من فضلك ادخل رقم الهاتف',
                'phone' => 'خطأ في رقم الهاتف',
                'unique' => 'رقم الهاتف تم حجزه من قبل شخص اخر',
                'max' => 'رقم الهاتف يجب ألا يتجاوز 9 أرقام',
            ],
            'name' => [
                'required' => 'من فضلك ادخل الاسم الشخصي',
            ],
            'password' => [
                'confirmed' => 'كلمة المرور غير متطابقة مع التآكيد',
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'email_or_mobile' => [
                'required' => 'من فضلك ادخل البريد الالكتروني أو رقم الهاتف',
            ],
        ],
    ],
    'reset' => [
        'form' => [
            'btn' => [
                'reset' => 'تعيين كلمة المرور الآن',
            ],
            'email' => 'البريد الالكتروني',
            'password' => 'كلمة المرور',
            'password_confirmation' => 'تأكيد كلمة المرور',
        ],
        'mail' => [
            'button_content' => 'تعين كلمة مرور جديدة',
            'header' => 'انت تستقبل هذا البريد الالكتروني لآنك قمت بطلب تعين كلمة مرور جديدة لفقدانك القديمة',
            'subject' => 'تعين كلمة مرور جديدة',
        ],
        'title' => 'تعين كلمة مرور جديدة',
        'validation' => [
            'email' => [
                'email' => 'من فضلك ادخل البريد بشكل صحيح',
                'exists' => 'هذا البريد غير موجود لدينا',
                'required' => 'من فضلك ادخل البريد الالكتروني',
            ],
            'password' => [
                'min' => 'كلمة المرور يجب ان تتكون من اكثر من ٦ مدخلات',
                'required' => 'يجب ان تدخل كلمة المرور',
            ],
            'token' => [
                'exists' => 'انتهت صلاحية هذا الطلب',
                'required' => 'لا تملك صلاحية تعين كلمة مرور جديدة قم بعمل طلب جديد',
            ],
        ],
        'messages' => [
            'success_reset' => 'تم تعيين كلمة المرور الجديدة بنجاح',
        ],
    ],
    'verification_code' => [
        'title' => 'كود التحقق',
        'enter_your_verification_code' => 'يرجى إدخال كود التحقق الذى تم إرساله إليكم.',
        'mobile_code_is_not_confirmed' => 'رقم الهاتف غير مفعل',
        'click_here_to_confirm' => 'اضغط هنا للتفعيل',
        'form' => [
            'code' => 'كود التحقق',
            'btn' => [
                'send' => 'إرسال',
            ],
        ],
        'validation' => [
            'verification_code' => [
                'required' => 'من فضلك ادخل كود التحقق',
                'exists' => 'كود التحقق غير موجود',
            ],
            'mobile' => [
                'exists' => 'رقم الهاتف غير مسجل لدينا',
            ],
        ],
        'messages' => [
            'your_verification_code_is' => 'كود التحقق الخاص بك هو:',
            'unable_to_send_verification_code' => 'لم نتمكن من إرسال رمز التحقق إليك ، حاول مرة أخرى',
        ],
    ],
];
